[
  {
    "id": "ball_ring_game",
    "label": "Convex unit and elevated aperture",
    "description": "An abstract environment with a movable compact unit and a suspended frame defining a narrow opening above a planar region.",
    "world": "ENTITIES:\n- Unit S1: a compact, approximately convex three-dimensional body with near-uniform mass distribution. Local contact from an agent can impart linear motion; surface interactions are nearly elastic and do not constrain orientation.\n- Frame F1: a rigid structure fixed to a vertical boundary segment. F1 encloses a simply connected opening whose cross-section is slightly larger than the maximal cross-section of S1.\n- Region C1: a bounded recess positioned immediately beyond the lower boundary of F1's opening. If S1 passes fully through the opening, C1 retains S1 against further motion.\n\nENVIRONMENT:\n- Domain P: a flat, unobstructed two-dimensional surface on which both the agent and S1 can translate. One boundary of P coincides with the vertical plane segment that supports F1, at height h above P, where h exceeds the agent's maximum direct reach.\n\nCONSTRAINTS:\n- Agent A can translate freely over P, reorient S1, and apply finite impulses to S1 whenever A and S1 share a contact point on P.\n- A cannot directly contact or modify F1 or C1 and cannot occupy positions above the vertical support line of F1.",
    "intended_affordance": "Repeated attempts by A to generate trajectories for S1 such that S1 passes through the opening defined by F1 and comes to rest within C1, starting from initial positions on P at nonzero horizontal distance from the supporting boundary."
  },
  {
    "id": "rod_line_water",
    "label": "Levered tether and mobile units",
    "description": "An abstract environment with a pivotable rigid segment carrying a flexible extension that terminates in a small capture feature above a region of self-propelled units.",
    "world": "ENTITIES:\n- Structure L1: a rigid, elongated segment anchored near one end at a support point along the edge of a spatial region R. L1 can be reoriented by the agent around this support.\n- Element T1: a flexible, low-mass element attached near the distal end of L1. T1 can extend into region R when L1 is oriented downward and retract when L1 is raised.\n- Element H1: a small rigid feature at the free end of T1 with protrusions or notches that can mechanically interlock with corresponding features on other units.\n- Units U1..Un: multiple small bodies within R that move autonomously along limited trajectories and may occasionally come into contact with H1.\n\nENVIRONMENT:\n- Region R: a horizontally extended volume contiguous with the edge where L1's support point lies. R has sufficient depth that H1 can be fully immersed when T1 is extended.\n\nCONSTRAINTS:\n- Agent A can grasp and manipulate the proximal portion of L1 near its support, rotating L1 within its allowed range so that T1 and H1 move into and out of R.\n- A cannot enter R directly but can sense changes in resistance transmitted through L1 when H1 mechanically engages with one of the mobile units.",
    "intended_affordance": "Positioning H1 inside region R via L1 and T1, waiting for mechanical interlock with a mobile unit, then applying upward motion on L1 to transfer that unit from inside R to outside R."
  },
  {
    "id": "rails_and_cube",
    "label": "Low-friction block and triple guides",
    "description": "A synthetic environment with a low-friction block and three parallel support guides that constrain its motion along a single direction.",
    "world": "ENTITIES:\n- Block B1: a finite rigid body whose outer boundary approximates a rectangular prism. All contact faces have low friction relative to the guides.\n- Guides G1, G2, G3: three parallel, rigid support elements mounted at equal height above a reference surface. The spacing between the guides is slightly larger than the width of B1 so that, when placed across them, B1 is supported but has limited lateral motion.\n- Platform P1: an elevated region at one end of the guides with a shallow recess whose shape matches that of B1, allowing a stable initial configuration.\n\nENVIRONMENT:\n- An open region surrounding the guides large enough for an agent to move alongside their entire length.\n\nCONSTRAINTS:\n- Agent A can reposition B1 by hand, place it within the recess on P1 so it simultaneously contacts all three guides, and apply tangential forces to B1 to initiate motion along the guide direction.\n- A cannot modify the geometry of the guides, alter the friction coefficients, or introduce additional support structures.",
    "intended_affordance": "Placing B1 in the recess on P1 so it is supported by all three guides, then applying force so that B1 travels smoothly along the guides from the platform end to the opposite end without losing contact with the guides."
  },
  {
    "id": "jump_rope",
    "label": "Oscillating loop and stepping body",
    "description": "An abstract environment with a flexible loop controlled by an agent and a planar region the agent can step on and off.",
    "world": "ENTITIES:\\n- Loop R1: a closed, flexible filament forming a continuous loop. The loop can deform and move freely in space, but its total length remains constant.\\n- Handles H1 and H2: two rigid segments attached at opposite points on R1. Each handle is sized for a single hand of the agent.\\n\\nENVIRONMENT:\\n- Plane P: a flat surface on which the agent can stand with both feet. The loop R1 can move through the space above and around P.\\n\\nCONSTRAINTS:\\n- Agent A can grasp H1 and H2, one in each hand, and move them along arcs so that different portions of R1 sweep through the volume around A and P.\\n- A can modulate the speed and timing of handle motion and can step on and off Plane P by lifting feet at chosen times.\\n- Gravity acts so that when R1 is not under tension, parts of it hang downward toward P.",
    "intended_affordance": "Coordinating arm motion to cause R1 to rotate in a roughly vertical plane so that a segment of the loop passes periodically just above Plane P, and synchronizing foot lifts so that A steps clear of R1 as it sweeps under their feet, repeatedly, without R1 striking the body."
  }
]
